Config/Documents/ПеремещениеОСЗабаланс.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПеремещениеОСЗабаланс</Name>
			<Comment>(Общ)</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобытиеОС</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СобытияОС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗабалансовыйСчет</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОС</Name>
					<Comment>(Общ)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИнвентарныйНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>9</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсновноеСредство</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/InformationRegisters/ТекущиеКадровыеДанныеСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ТекущиеКадровыеДанныеСотрудников</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТекущееПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущаяДолжность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаУвольнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновноеРабочееМестоВОрганизации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПриема</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущийВидЗанятости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЗанятости</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОформленПоТрудовомуДоговору</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>22</v8:Digits>
							<v8:FractionDigits>20</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТекущаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Documents/ПеремещениеОСЗабаланс/Ext/ManagerModule.bsl
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт 
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ОС2Забаланс";
	КомандаПечати.Представление = "ОС-2 (Забаланс)";
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "ФормаСпискаУпр,ФормаДокументаУпр";
	
КонецПроцедуры 

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт 	
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ОС2Забаланс") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ОС2Забаланс", "ОС2Забаланс", 
		ПечатьОС2(МассивОбъектов),"Документ.ПеремещениеОСЗабаланс.ОС2Забаланс");
	КонецЕсли;
	
КонецПроцедуры 

Функция ПечатьОС2(МассивОбъектов)Экспорт
	
	Ссылка = МассивОбъектов[0];
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПеремещениеОСЗабаланс.Организация КАК Организация,
	|	ПеремещениеОСЗабаланс.Организация.КодПоОКПО КАК КодПоОКПО,
	|	ПеремещениеОСЗабаланс.Номер КАК НомерДок,
	|	ПеремещениеОСЗабаланс.Дата КАК ДатаДок,
	|	ПеремещениеОСЗабаланс.ЗабалансовыйСчет КАК ЗабалансовыйСчет,
	|	ПеремещениеОСЗабаланс.СкладОтправитель КАК СдатчикРасшифровкаПодписи,
	|	ПеремещениеОСЗабаланс.СкладПолучатель КАК ПолучательРасшифровкаПодписи,
	|	Константы.ВалютаРегламентированногоУчета.Наименование КАК Валюта
	|ИЗ
	|	Документ.ПеремещениеОСЗабаланс КАК ПеремещениеОСЗабаланс,
	|	Константы КАК Константы
	|ГДЕ
	|	ПеремещениеОСЗабаланс.Ссылка = &Ссылка";
	ВыборкаПоШапке = Запрос.Выполнить().Выбрать();
	ВыборкаПоШапке.Следующий();
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка",      Ссылка);
	Запрос.УстановитьПараметр("Организация", ВыборкаПоШапке.Организация);
	Запрос.УстановитьПараметр("Период",      Новый Граница(ССылка.Дата, ВидГраницы.Исключая));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПеремещениеОСЗабалансОС.НомерСтроки КАК НС,
	|	ПеремещениеОСЗабалансОС.ИнвентарныйНомер КАК ИнвНомер,
	|	ПеремещениеОСЗабалансОС.ОсновноеСредство КАК НаименованиеОС,
	|	ПеремещениеОСЗабалансОС.Количество КАК Количество,
	|	ПеремещениеОСЗабалансОС.Стоимость КАК СуммаПеремещения
	|ИЗ
	|	Документ.ПеремещениеОСЗабаланс.ОС КАК ПеремещениеОСЗабалансОС
	|ГДЕ
	|	ПеремещениеОСЗабалансОС.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";	
	
	ВыборкаПоОС = Запрос.Выполнить().Выбрать();
	ТабДокумент   = Новый ТабличныйДокумент();	
	// Зададим параметры макета
	ТабДокумент.ПолеСверху         = 0;
	ТабДокумент.ПолеСлева          = 0;
	ТабДокумент.ПолеСнизу          = 0;
	ТабДокумент.ПолеСправа         = 0;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПеремещениеОСЗабаланс_ОС2";
	
	Макет                 = ПолучитьМакет("ОС2Забаланс");
	ОбластьШапка1         = Макет.ПолучитьОбласть("Шапка1");
	ОбластьСтрока         = Макет.ПолучитьОбласть("Строка");
	ОбластьПодвалСтраницы = Макет.ПолучитьОбласть("ПодвалСтраницы");
	ОбластьПодвал         = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапка2         = Макет.ПолучитьОбласть("Шапка2");
	
	ОбластьШапка1.Параметры.Заполнить(ВыборкаПоШапке);
	СведенияОбОрганизации    = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(ВыборкаПоШапке.Организация, ВыборкаПоШапке.ДатаДок);
	ПредставлениеОрганизации = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОбОрганизации, "НаименованиеДляПечатныхФорм");
	ОбластьШапка1.Параметры.Организация = ПредставлениеОрганизации;	
	
	МОЛПолучатель = ОтветственноеЛицоНаСкладе(ВыборкаПоШапке.ПолучательРасшифровкаПодписи, ВыборкаПоШапке.ДатаДок);
	МОЛСдатчик =   ОтветственноеЛицоНаСкладе(ВыборкаПоШапке.СдатчикРасшифровкаПодписи, ВыборкаПоШапке.ДатаДок);

	Если ЗначениеЗаполнено(МОЛПолучатель) Тогда  //ЮЦАУ
		ДанныеМОЛ = ОбщегоНазначенияБПВызовСервера.ДанныеФизЛиц(ВыборкаПоШапке.Организация, МОЛПолучатель, ВыборкаПоШапке.ДатаДок);
		ОбластьШапка1.Параметры.ПодрПолучатель    = ПолучитьДолжностьФизЛица(МОЛПолучатель) + " " + ДанныеМОЛ[0].Представление;
	КОнецЕсли;
	
	Если ЗначениеЗаполнено(МОЛСдатчик) Тогда
		ДанныеМОЛ = ОбщегоНазначенияБПВызовСервера.ДанныеФизЛиц(ВыборкаПоШапке.Организация, МОЛСдатчик, ВыборкаПоШапке.ДатаДок);
		ОбластьШапка1.Параметры.ПодрСдатчик          = ПолучитьДолжностьФизЛица(МОЛСдатчик) + " " + ДанныеМОЛ[0].Представление;
	КОнецЕсли;

	ТабДокумент.Вывести(ОбластьШапка1);
	
	ИтогСумма = 0;
	
	Пока ВыборкаПоОС.Следующий() Цикл		
		ОбластьСтрока.Параметры.Заполнить(ВыборкаПоОС);		
		ОбластьСтрока.Параметры.НаименованиеОС = СокрЛП(ВыборкаПоОС.НаименованиеОС);		
		СтрокаСПодвалом = Новый Массив;
		СтрокаСПодвалом.Добавить(ОбластьСтрока);
		СтрокаСПодвалом.Добавить(ОбластьПодвал);
		
		Если НЕ ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабДокумент, СтрокаСПодвалом) Тогда
			ТабДокумент.Вывести(ОбластьПодвалСтраницы);
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			ТабДокумент.Вывести(ОбластьШапка2);
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьСтрока);
		ИтогСумма = ИтогСумма + ВыборкаПоОС.СуммаПеремещения;
		
	КонецЦикла;
	
	ОбластьПодвал.Параметры.ИтогСумма = ИтогСумма;
	ОбластьПодвал.Параметры.Заполнить(ВыборкаПоШапке);
	
	ОтветственныеЛица = ОтветственныеЛицаБП.ОтветственныеЛица(ВыборкаПоШапке.Организация, ВыборкаПоШапке.ДатаДок,);
	
	ОбластьПодвал.Параметры.ГлавБух = ОтветственныеЛица.ГлавныйБухгалтерПредставление;
	
	Если ЗначениеЗаполнено(МОЛСдатчик) Тогда
		ДанныеМОЛ = ОбщегоНазначенияБПВызовСервера.ДанныеФизЛиц(ВыборкаПоШапке.Организация, МОЛСдатчик, ВыборкаПоШапке.ДатаДок);
		ОбластьПодвал.Параметры.СдатчикДолжность          = ПолучитьДолжностьФизЛица(МОЛСдатчик);
		ОбластьПодвал.Параметры.СдатчикРасшифровкаПодписи = ДанныеМОЛ[0].Представление;
		ОбластьПодвал.Параметры.СдатчикТабельныйНомер     = ДанныеМОЛ[0].ТабельныйНомер;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(МОЛПолучатель) Тогда
		ДанныеМОЛ = ОбщегоНазначенияБПВызовСервера.ДанныеФизЛиц(ВыборкаПоШапке.Организация, МОЛПолучатель, ВыборкаПоШапке.ДатаДок);
		ОбластьПодвал.Параметры.ПолучательДолжность          = ПолучитьДолжностьФизЛица(МОЛПолучатель);
		ОбластьПодвал.Параметры.ПолучательРасшифровкаПодписи = ДанныеМОЛ[0].Представление;
		ОбластьПодвал.Параметры.ПолучательТабельныйНомер     = ДанныеМОЛ[0].ТабельныйНомер;
	КонецЕсли;

	ОбластьПодвал.Параметры.ДатаДок = ВыборкаПоШапке.ДатаДок;

	ТабДокумент.Вывести(ОбластьПодвал);
	
	Возврат ТабДокумент;
	
КонецФункции //

Функция ПолучитьДолжностьФизЛица(ФизическоеЛицо)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТекущиеКадровыеДанныеСотрудников.ФизическоеЛицо,
		|	ТекущиеКадровыеДанныеСотрудников.Сотрудник,
		|	ТекущиеКадровыеДанныеСотрудников.ГоловнаяОрганизация,
		|	ТекущиеКадровыеДанныеСотрудников.ТекущаяОрганизация,
		|	ТекущиеКадровыеДанныеСотрудников.ТекущееПодразделение,
		|	ТекущиеКадровыеДанныеСотрудников.ТекущаяДолжность,
		|	МАКСИМУМ(ТекущиеКадровыеДанныеСотрудников.ДатаПриема) КАК ДатаПриема,
		|	ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения,
		|	ТекущиеКадровыеДанныеСотрудников.ОсновноеРабочееМестоВОрганизации,
		|	ТекущиеКадровыеДанныеСотрудников.ТекущийВидЗанятости
		|ИЗ
		|	РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
		|ГДЕ
		|	ТекущиеКадровыеДанныеСотрудников.ФизическоеЛицо = &ФизическоеЛицо
		|
		|СГРУППИРОВАТЬ ПО
		|	ТекущиеКадровыеДанныеСотрудников.ФизическоеЛицо,
		|	ТекущиеКадровыеДанныеСотрудников.Сотрудник,
		|	ТекущиеКадровыеДанныеСотрудников.ГоловнаяОрганизация,
		|	ТекущиеКадровыеДанныеСотрудников.ТекущаяОрганизация,
		|	ТекущиеКадровыеДанныеСотрудников.ТекущееПодразделение,
		|	ТекущиеКадровыеДанныеСотрудников.ТекущаяДолжность,
		|	ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения,
		|	ТекущиеКадровыеДанныеСотрудников.ОсновноеРабочееМестоВОрганизации,
		|	ТекущиеКадровыеДанныеСотрудников.ТекущийВидЗанятости
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаПриема УБЫВ";
	
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат Строка(ВыборкаДетальныеЗаписи.ТекущаяДолжность);
	Иначе
		Возврат Строка("");
	КонецЕсли;

КонецФункции	

// Возвращает ответственное лицо на складе на указанную дату
//
Функция ОтветственноеЛицоНаСкладе(Склад, Дата) Экспорт
	
	Возврат ОтветственныеЛицаБППереопределяемый.ОтветственноеЛицоНаСкладе(Склад, Дата);

КонецФункции
